fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВКМ_ДобавитьДопРеквизитыНаФорму();
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ВМК_УстановитьВидимостьЭлементов(Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	Если Объект.ВидДоговора = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ВМК_УстановитьВидимостьЭлементов(Истина);
	Иначе
		ВМК_УстановитьВидимостьЭлементов(Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавитьДопРеквизитыНаФорму()

	ПолеПериодДействия = Элементы.Добавить("ЭлементПериодДействия", Тип("ПолеФормы"));
	ПолеПериодДействия.Вид = ВидПоляФормы.ПолеВвода;
	ПолеПериодДействия.ПутьКДанным = "Объект.ВКМ_ПериодДействия";
	ПолеПериодДействия.Видимость = Ложь;
	
	ПолеСуммаАбонентскойПлаты = Элементы.Добавить("ЭлементСуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ПолеСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ПолеСуммаАбонентскойПлаты.Видимость = Ложь;
	
	ПолеСтоимостьЧасаРаботы = Элементы.Добавить("ЭлементСтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ПолеСтоимостьЧасаРаботы.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ВМК_УстановитьВидимостьЭлементов(ЗначениеВидимости)
	Элементы.ЭлементПериодДействия.Видимость = ЗначениеВидимости;
	Элементы.ЭлементСуммаАбонентскойПлаты.Видимость = ЗначениеВидимости;
	Элементы.ЭлементСтоимостьЧасаРаботы.Видимость = ЗначениеВидимости;
КонецПроцедуры

#КонецОбласти
